Revit 2024 API
FabricationPart.ProductName Property
 The product name of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string ProductName { get; }
Visual Basic
Public ReadOnly Property ProductName As String
	Get
Visual C++
public:
property String^ ProductName {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace